#include <iostream>
using namespace std;
int book[500000000];
int n, m;
int main()
{
    // freopen("ss.out","w",stdout);
    cout << "|------------------------------------------------|" << endl;
    cout << "|________________欢迎使用质数生成器_______________|" << endl;
    cout << "|    该项目由CBYHD制作，官方网站：exe.cbyhd.com---|" << endl;
    cout << "|------------------------------------------------|" << endl;
    cout << "|请输入两个数，用空格间隔,分别为生成素数的起始位置和|" << endl;
    cout << "|结束数字 感谢您的使用！:)                        |" << endl;
    cout << "|------------------------------------------------|" << endl;
    cin >> n >> m;
    for (int i = n > 2 ? n : 2; i <= m; i++)
    {
        if (!book[i])
        {
            cout << i << " ";
            for (int j = i; j <= n / i; j++)
            {
                book[i * j] = 1;
            }
        }
    }
    return 0;
}
//         ----------------------------------------------
//         |更多代码：github.com/cbyhd/xinao             |
//         ----------------------------------------------